<?php
//加载模版引擎
require_once 'smarty3/Smarty.class.php';
$tpl = new Smarty();	
$tpl->template_dir = "templates/";
$tpl->compile_dir = "templates_c/";
$tpl->caching =false;

$titles2 = array(1=>'去除字符串左右两边的空格',2=>'验证是否输入',3=>'禁止输入',4=>'关闭输入法',5=>'禁止复制与粘贴',
	6=>'限制只能输入数字',7=>'限制只能输入中文',8=>'限制字符串的长度',9=>'限制字符串的长度',
	10=>'实时显示还可以输入多少字符（区分中英文）',11=>'显示输入提示，获取焦点提示取消',12=>'文本框中的文本自动滚动的效果',
	13=>'密码强度实时验证',14=>'回车提交',
	15=>'光标永远停留在文字最后',16=>'不允许文本框自动完成',17=>'自动选定TextArea内容',18=>'获取、失去焦点时改变样式',
	19=>'常见的验证规则',20=>'对文本内容进行关键词过滤',21=>'从字符串中剔除所有HTML代码',22=>'测试是否为数值型',
	23=>'TextArea自适应文字行数多少',24=>'判断单选框是否选中',25=>'判断复选框至少选中一项',26=>'限制复选框最多选择几项',
	27=>'Checkbox全选、取消全选、反选',28=>'根据指定内容选中复选框',29=>'获取复选框所有选中内容',
	30=>'判断下拉框是否选中',31=>'动态添加下拉选项',32=>'动态删除下拉选项',33=>'下拉框联动效果',34=>'可输入下拉框效果',
	35=>'简单的数字及字符操作',36=>'设置表单中所有文本型的成员的值为空',37=>'JavaScript对上传文件相关操作');

$titles3= array(1=>'点击元素会触发元素向右移动，移动结束后会触发回调',2=>'实时预览上传图片',3=>'鼠标移入移出，改变图片样式',
	4=>'移动鼠标图片放大镜',5=>'水中倒影效果',6=>'横向轮播效果',7=>'图片层叠轮播',8=>'点击图片缓缓放大',
	9=>'图片旋转',10=>'类似QQ相册效果');

$titles4 = array(1=>'单元行上鼠标悬停提示',2=>'表格光棒效果',3=>'让表单没有凹凸感',4=>'动态插入和删除单元行',
	5=>'表格内容的展开和折叠效果',
	6=>'表格内容拖拽效果',7=>'使用js对表格内容进行分页',8=>'英文字符串超出元素宽度自动换行',9=>'内容超过元素宽度显示省略号',
	10=>'调整字体大小',11=>'实现打字机效果',12=>'文本段落的展开和收拢效果',
	13=>'关键字的高亮显示',14=>'字幕上下间歇滚动',
	15=>'弹出层',16=>'层模拟的提示消息框',17=>'隐藏层',18=>'用层实现滚动条',
	19=>'让层可以随意拖动',20=>'遮罩层效果',21=>'Tab选项卡切换',22=>'对联浮动广告',
	23=>'类似QQ消息窗口提示',24=>'修改浏览器title',25=>'打开链接时弹出确认框',26=>'删除时弹出确认对话框');

$titles5 = array(1=>'打开新页面',2=>'打开指定大小的窗口',3=>'打开模式子窗口',4=>'获取子窗口的返回值',
	5=>'刷新iframe窗口',
	6=>'刷新当前页面',7=>'不弹出提示框关闭父窗口',8=>'弹出窗口关闭时刷新父窗口',9=>'子窗口全屏',
	10=>'屏蔽右键',11=>'网页将不能被另存为',12=>'防止被人frame',
	13=>'永远都会带着框架',14=>'禁止滚动条',
	15=>'禁止查看源代码',16=>'取消选取、防止复制',17=>'添加到收藏夹',18=>'网页设置为首页',
	19=>'将网页另存为',20=>'IE地址栏前换成自己的图标',21=>'在收藏夹中显示出你的图标',22=>'查看网页源代码',
	23=>'判断上一页的来源',24=>'最小化、最大化、关闭窗口',25=>'网页不会被缓存',26=>'检测某个网站的链接速度',
	27=>'脚本永不出错',28=>'防止点击空链接，页面重置到页的首端',29=>'获取浏览器信息',30=>'URL传参中文出现乱码',
	31=>'获取地址栏URL的参数',32=>'获得一个窗口的大小',33=>'让弹出窗口总是在最上面',34=>'屏蔽功能键Shift,Alt,Ctrl',
	35=>'页面慢慢变大',36=>'IE浏览器页面进入和退出的特效',37=>'页面全屏',38=>'定时关闭页面',39=>'页面打印及预览指定区域',
	40=>'去掉打印时的页眉页脚');


$titles6 = array(1=>'获取日期的指定部分',2=>'显示当前时间',3=>'显示最后修改时间',4=>'实时显示当前时间',
	5=>'日期格式化成字符串',
	6=>'获取短日期格式',7=>'获取指定日期所在月份的天数',8=>'获取指定日期所在周是第几周',9=>'到指定日期时间的倒计时',
	10=>'比较两个日期的差',11=>'日期比较大小',12=>'对指定日期进行加减',
	13=>'字符串转换为日期格式',14=>'判断日期是闰年还是平年',
	15=>'日期合法性验证');

$titles7 = array(1=>'页面悬浮导航',2=>'下拉式导航菜单',3=>'滑动门导航',4=>'树形菜单导航',
	5=>'仿QQ菜单',
	6=>'漂浮广告',7=>'滑动展开/收缩广告',8=>'定时关闭的背投广告',9=>'随图片快速翻动幻灯代码',
	10=>'页面五颜六色的雪花');

$titles8 = array(1=>'区分平台类型',2=>'方向变更',3=>'移除移动浏览器地址栏',4=>'防止网页触摸滚动',
	5=>'使用JavaScript代码调用百度地图',
	6=>'获取当前地理坐标',7=>'判别是否为移动浏览器');

$titles9 = array(1=>'网页图片较多时，分批次加载图片',2=>'JS解析XML数据',3=>'JS解析JSON数据',4=>'跨浏览器的Ajax',
	5=>'使用Ajax轻松加载文件',
	6=>'跨浏览器的XML读取代码',7=>'HTML5版Js实现的音频播放器',8=>'Ajax实现导航',9=>'类似百度的自动完成功能',
	10=>'等级星投票效果',11=>'IE导出表格');

$titles_arr = array(2=>$titles2,3=>$titles3,4=>$titles4,5=>$titles5,6=>$titles6,7=>$titles7,8=>$titles8,9=>$titles9);

foreach ($titles_arr as $index => $titles) {
	# code...
	$tpl->assign('chapt',$index);
	$tpl->assign('titles',$titles);
	$html = $tpl->fetch('js.html');
	write_file("../js/{$index}/index.html",$html);
}


// 写入文件
function write_file($file, $content){
	$fp = fopen($file, 'w+');
	fwrite($fp, $content);
	fclose($fp);
}


/**
* An easier way to do mkdirs : recursion.
*
* @param string $strPath
* @param integer $mode
* @return bool
*/

function mkdirs($strPath = '', $mode = 0777) {
	if (is_dir($strPath)) return true;

	$pStrPath = dirname($strPath);

	if (!mkdirs($pStrPath, $mode)) return false;

	return mkdir($strPath, $mode);
}

?>